tutorials/FSI/laminar/Fluid/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pcorr)"
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.01;
        smoother        DICGaussSeidel;
    }

    "(p|pcorr)Final"
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|cellDisplacement)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }

    "(U|cellDisplacement)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
    } 

}

PIMPLE
{
    nOuterCorrectors         150;
    nCorrectors              1;
    nNonOrthogonalCorrectors 1;
    consistent               yes;
    correctPhi               yes;
    momentumPredictor        yes; 
    
    outerCorrectorResidualControl
    {
        U
        {
            relTol          0;
            tolerance       1e-6;
        }

        p
        {
            relTol          0;
            tolerance       1e-5;
        }
    }

    residualControl
    {
        "(U|p)" 1e-7;
    }


    //transonic           no;
    //simpleRho           yes;
    //pMaxFactor          1.5;
    //pMinFactor          0.9;
    //turbOnFinalIterOnly no;
}

relaxationFactors
{
    "U.*"   1;
}

cache
{
    grad(U);
}

// ************************************************************************* //
